levels_data = [
  {
    "level": 1,
    "xp": 0,
    "role": "Новичок"
  },
  {
    "level": 2,
    "xp": 300,
    "role": "Работник",
  },
  {
    "level": 3,
    "xp": 800,
    "role": "Работник"
  },
  {
    "level": 4,
    "xp": 1300,
    "role": "Работник",
  },
  {
    "level": 5,
    "xp": 2000,
    "role": "Работник",
  },
  {
    "level": 6,
    "xp": 2700,
    "role": "Работник месяца",
  },
  {
    "level": 7,
    "xp": 3500,
    "role": "Лох",
  },
  {
    "level": 8,
    "xp": 4500,
    "role": "Лох",
  },
  {
    "level": 9,
    "xp": 5500,
    "role": "Трудяга"
  },
  {
    "level": 10,
    "xp": 7000,
    "role": "Трудяга"
  },
  {
    "level": 11,
    "xp": 8500,
    "role": "Любитель",
  },
  {
    "level": 12,
    "xp": 10000,
    "role": "Любитель"
  },
  {
    "level": 13,
    "xp": 12000,
    "role": "Любитель"
  },
  {
    "level": 14,
    "xp": 14000,
    "role": "Опытный",
  },
  {
    "level": 15,
    "xp": 16000,
    "role": "Опытный",
  },
  {
    "level": 16,
    "xp": 18000,
    "role": "Опытный",
  },
  {
    "level": 17,
    "xp": 20000,
    "role": "Профи",
  },
  {
    "level": 18,
    "xp": 23000,
    "role": "Профи",
  },
  {
    "level": 19,
    "xp": 26000,
    "role": "Профи"
  },
  {
    "level": 20,
    "xp": 30000,
    "role": "Зам директора",
  },
  {
    "level": 21,
    "xp": 34000,
    "role": "Зам директора"
  },
  {
    "level": 22,
    "xp": 38000,
    "role": "Зам директора"
  },
  {
    "level": 23,
    "xp": 42000,
    "role": "Директор"
  },
  {
    "level": 24,
    "xp": 46000,
    "role": "Директор"
  },
  {
    "level": 25,
    "xp": 50000,
    "role": "Директор"
  },
  {
    "level": 26,
    "xp": 55000,
    "role": "Главный директор"
  },
  {
    "level": 27,
    "xp": 60000,
    "role": "Главный директор"
  },
  {
    "level": 28,
    "xp": 65000,
    "role": "Главный директор"
  },
  {
    "level": 29,
    "xp": 70000,
    "role": "Главный директор"
  },
  {
    "level": 30,
    "xp": 80000,
    "role": "Глава"
  },
  {
    "level": 31,
    "xp": 90000,
    "role": "Глава",
  },
  {
    "level": 32,
    "xp": 100000,
    "role": "Ветеран ROLe"
  },
  {
    "level": 33,
    "xp": 115000,
    "role": "Ветеран ROLe"
  },
  {
    "level": 34,
    "xp": 130000,
    "role": "Ветеран ROLe"
  },
  {
    "level": 35,
    "xp": 150000,
    "role": "Генерал армии ROLe"
  },
  {
    "level": 36,
    "xp": 165000,
    "role": "Генерал армии ROLe"
  },
  {
    "level": 37,
    "xp": 180000,
    "role": "Генерал армии ROLe"
  },
  {
    "level": 38,
    "xp": 200000,
    "role": "Миф"
  },
  {
    "level": 39,
    "xp": 220000,
    "role": "Миф"
  },
  {
    "level": 40,
    "xp": 240000,
    "role": "Президент ROLe"
  },
  {
    "level": 41,
    "xp": 260000,
    "role": "Президент ROLe"
  },
  {
    "level": 42,
    "xp": 280000,
    "role": "Президент ROLe",
  },
  {
    "level": 43,
    "xp": 300000,
    "role": "Легенда"
  },
  {
    "level": 44,
    "xp": 330000,
    "role": "Легенда"
  },
  {
    "level": 45,
    "xp": 360000,
    "role": "Легенда"
  },
  {
    "level": 46,
    "xp": 400000,
    "role": "Непокалебимый"
  },
  {
    "level": 47,
    "xp": 433333,
    "role": "Непокалебимый"
  },
  {
    "level": 48,
    "xp": 466666,
    "role": "Непокалебимый",
  },
  {
    "level": 49,
    "xp": 500000,
    "role": "Полубог"
  },
  {
    "level": 50,
    "xp": 550000,
    "role": "Полубог"
  },
  {
    "level": 51,
    "xp": 600000,
    "role": "Бог"
  }
]


xp_list = [(lvl['xp'], lvl['level']) for lvl in levels_data]


which_my_role = {
  lvl['level']: lvl['role']
  for lvl in levels_data
}
