export const messageTask = [
  "Поздравляем! Задача выполнена!",
  "Так держать! Задача выполнена!",
  "Задача уничтожена",
  "Задача разъебана",
  "Отличная работа",
  "Взял и порвал задание, так держать!",
  "Ты выполнил свой квест, поздравляю!",
  "Каждый выполненный шаг, приносит к успеху",
  "Каждый шаг к цели — твоя победа",
  "Пришел, увидел, победил",
  "Каждый день — шанс стать сильнее, бро",
  "Ты сильнейший"
]

export const messageUpLevel = [
  "Уровень повышен",
  "Ты не только задачу уничтожил, но и уровень повысил? Четко братан",
  "Уровень повысился, ты красавчик!",
  "Уровень повысился, чуешь мощь?",
  "ВААААААЙ БРАТ ТЫ ЧТО УРОВЕНЬ ПОВЫСИЛ? ДА ТЫ АХУЕНЕН БРАТАН"
]

export const messageWeeklyBonus = [
  "Недельная норма выполнена, поздравляем!",
  "Ай красава! Разъебал эту неделю!",
  "Неделя уничтожена, но не все лишнее убило!",
]
